===========================================================================================
dot_chain_simple
===========================================================================================

x.y.z

---

(module
  (chain
    start: (identifier)
    node: (dot)
    node: (identifier)
    node: (dot)
    node: (identifier)
  )
)

===========================================================================================
dot_chain_indented
===========================================================================================

foo
  .bar
  .baz

---

(module
  (chain
    start: (identifier)
    node: (dot)
    node: (identifier)
    node: (dot)
    node: (identifier)
  )
)

===========================================================================================
dot_chain_with_function_call
===========================================================================================

x.y().z

---

(module
  (chain
    start: (identifier)
    node: (dot)
    node: (identifier)
    node: (tuple)
    node: (dot)
    node: (identifier)
  )
)

===========================================================================================
chained_calls_simple
===========================================================================================

x()()()

---

(module
  (chain
    start: (identifier)
    node: (tuple)
    node: (tuple)
    node: (tuple)
  )
)

===========================================================================================
chained_calls_with_args
===========================================================================================

x()(a)(1 + 2)

---

(module
  (chain
    start: (identifier)
    node: (tuple)
    node: (tuple (identifier))
    node: (tuple (binary_op (number) (number)))
  )
)

===========================================================================================
chained_index
===========================================================================================

x[0][1]

---

(module
  (chain
    start: (identifier)
    node: (list (number))
    node: (list (number))
  )
)

===========================================================================================
calls_without_parentheses
===========================================================================================

f x
f g 1, 2

---

(module
  (chain
    start: (identifier)
    (call (identifier))
  )
  (chain
    start: (identifier)
    (call
      (chain
        start: (identifier)
        (call
         (number)
         (number)
        )
      )
    )
  )
)

