===========================================================================================
simple_dot_chain
===========================================================================================

a.b
a.b.c.d.e.f

---

(module
  (chain
    start: (identifier)
    lookup: (identifier)
  )
  (chain
    start: (identifier)
    lookup: (identifier)
    lookup: (identifier)
    lookup: (identifier)
    lookup: (identifier)
    lookup: (identifier)
  )
)

===========================================================================================
index_chain
===========================================================================================

a[1]
a[1..]

---

(module
  (chain
    start: (identifier)
    index: (number)
  )
  (chain
    start: (identifier)
    index: (range_from (number))
  )
)

===========================================================================================
function_call_without_parens
===========================================================================================

f x
f g 1, 2

---

(module
  (chain
    start: (identifier)
    (call 
      (call_arg (identifier))
    )
  )
  (chain
    start: (identifier)
    (call 
      (call_arg
        (chain
          start: (identifier)
          (call 
            (call_arg (number)) 
            (call_arg (number))
          )
        )
      )
    )
  )
)

===========================================================================================
function_call_with_parens
===========================================================================================

f(x)
f(g(1, 2))

---

(module
  (chain
    start: (identifier)
    call: (tuple (element (identifier)))
  )
  (chain
    start: (identifier)
    call: (tuple 
      (element
        (chain
          start: (identifier)
          call: (tuple 
            (element (number)) 
            (element (number))
          )
        )
      )
    )
  )
)

===========================================================================================
dots_and_calls_single_line
===========================================================================================

a.b()
a.b().c
a.b().c()

---

(module
  (chain
    start: (identifier)
    lookup: (identifier)
    call: (tuple)
  )
  (chain
    start: (identifier)
    lookup: (identifier)
    call: (tuple)
    lookup: (identifier)
  )
  (chain
    start: (identifier)
    lookup: (identifier)
    call: (tuple)
    lookup: (identifier)
    call: (tuple)
  )
)

===========================================================================================
dots_and_calls_multi_line
===========================================================================================

foo
  .bar()

---

(module
  (chain
    start: (identifier)
    lookup: (identifier)
    call: (tuple)
  )
)

===========================================================================================
null_check
===========================================================================================

foo?.bar

---

(module
  (chain
    start: (identifier)
    (null_check)
    lookup: (identifier)
  )
)
