===========================================================================================
identifiers
===========================================================================================

foo
bar9
underscore_separated
héllø
_
_bar9
_héllø

---

(module
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier))

===========================================================================================
comma_separated
===========================================================================================

foo, 'bar', 123

---

(module
  (identifier)
  (string)
  (number)
)

===========================================================================================
tuple_empty
===========================================================================================

(,) 

---

(module
  (tuple)
)

===========================================================================================
tuple_nested
===========================================================================================

(foo, bar, (baz))

---

(module
  (tuple
    (identifier)
    (identifier)
    (tuple
      (identifier))))

===========================================================================================
tuple_nested_multi_line
===========================================================================================

(
  foo, 
  bar
, (baz)
)

---

(module
  (tuple
    (identifier)
    (identifier)
    (tuple
      (identifier))))


===========================================================================================
list_multi_line
===========================================================================================

[
  foo, 
  bar
, (baz)
]

---

(module
  (list
    (identifier)
    (identifier)
    (tuple
      (identifier))))

===========================================================================================
binary_op
===========================================================================================

1 + 2 * 3 + 4

---

(module
  (binary_op
    (binary_op
      (number)
      (binary_op
        (number)
        (number)
      )
    )
    (number)
  )
)

===========================================================================================
binary_op_multi_line_post
===========================================================================================

1 + 
  2 * 
    3 + 
  4

---

(module
  (binary_op
    (binary_op
      (number)
      (binary_op
        (number)
        (number)
      )
    )
    (number)
  )
)


===========================================================================================
binary_op_multi_line_pre
===========================================================================================

1 
  + 2 
    * 3 
  + 4

---

(module
  (binary_op
    (binary_op
      (binary_op
        (number)
        (number)
      )
      (number)
    )
    (number)
  )
)
