===========================================================================================
identifiers
===========================================================================================

foo
bar9
underscore_separated
héllø
_
_bar9
_héllø
@main

---

(module
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (meta (meta_id))
)

===========================================================================================
comma_separated_single_line_2
===========================================================================================

true, false

---

(module
  (expressions
    (true)
    (false)
  )
)

===========================================================================================
comma_separated_single_line_3
===========================================================================================

foo, 'bar', 123

---

(module
  (expressions
    (identifier)
    (string)
    (number)
  )
)

===========================================================================================
comma_separated_single_line_4
===========================================================================================

'hello', a, 123, b

---

(module
  (expressions
    (string)
    (identifier)
    (number)
    (identifier)
  )
)

===========================================================================================
semicolon_separated
===========================================================================================

true; false
a, b, c; 1, 2, 3

---

(module
  (true)
  (false)
  (expressions
    (identifier)
    (identifier)
    (identifier)
  )
  (expressions
    (number)
    (number)
    (number)
  )
)

===========================================================================================
binary_op
===========================================================================================

1 + 2 * 3 + 4

---

(module
  (binary_op
    (binary_op
      (number)
      (binary_op
        (number)
        (number)
      )
    )
    (number)
  )
)

===========================================================================================
binary_op_multi_line_pre
:skip
===========================================================================================

1
  + 2
    * 3
  + 4

---

(module
  (binary_op
    (binary_op
      (binary_op
        (number)
        (number)
      )
      (number)
    )
    (number)
  )
)

===========================================================================================
binary_op_multi_line_post
===========================================================================================

1 +
  2 *
    3 +
  4

---

(module
  (binary_op
    (binary_op
      (number)
      (binary_op
        (number)
        (number)
      )
    )
    (number)
  )
)

===========================================================================================
boolean_chain
===========================================================================================

true and foo and false

---

(module
  (boolean_op
    (boolean_op
      (true)
      (identifier)
    )
    (false)
  )
)

===========================================================================================
return_indented
===========================================================================================

return
  foo

---

(module
  (return (identifier))
)

===========================================================================================
yield_indented
===========================================================================================

yield
  foo

---

(module
  (yield (identifier))
)

===========================================================================================
import
===========================================================================================

import foo
import foo as bar
from foo import 'bar'
from foo.bar import x, 'y'
from 'hello' import foo
from foo import bar as x, baz as y

---

(module
  (import
    (import_item (identifier))
  )
  (import
    (import_item (identifier) (identifier))
  )
  (import
    (import_module (identifier))
    (import_item (string))
  )
  (import
    (import_module (identifier) (identifier))
    (import_item (identifier))
    (import_item (string))
  )
  (import
    (import_module (string))
    (import_item (identifier))
  )
  (import
    (import_module (identifier))
    (import_item (identifier) (identifier))
    (import_item (identifier) (identifier))
  )
)

===========================================================================================
import_with_three_items
===========================================================================================

from foo import a, b, c

---

(module
  (import
    (import_module (identifier))
    (import_item (identifier))
    (import_item (identifier))
    (import_item (identifier))
  )
)

===========================================================================================
debug
===========================================================================================

debug foo
debug 1 + 1
debug x, y

---

(module
  (debug (identifier))
  (debug (binary_op (number) (number)))
  (debug (identifier) (identifier))
)
