===========================================================================================
identifiers
===========================================================================================

foo
bar9
underscore_separated
héllø
_
_bar9
_héllø

---

(module
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier))

===========================================================================================
comma_separated
===========================================================================================

foo, 'bar', 123

---

(module
  (identifier)
  (string)
  (number)
)

===========================================================================================
Parenthesized
===========================================================================================

(foo, bar, (baz))

---

(module
  (parenthesized_expression
    (identifier)
    (identifier)
    (parenthesized_expression
      (identifier))))

===========================================================================================
binary_op
===========================================================================================

1 + 2 * 3 + 4

---

(module
  (binary_op
    (binary_op
      (number)
      (binary_op
        (number)
        (number)
      )
    )
    (number)
  )
)

