===========================================================================================
constants
===========================================================================================

true
false
null
self

---

(module
  (boolean)
  (boolean)
  (null)
  (self)
)

===========================================================================================
integers
===========================================================================================

0
123
-99

---

(module
  (number)
  (number)
  (negate (number))
)

===========================================================================================
floats
===========================================================================================

0.
1.0
1e99
123.0e-33
44e+9
-1.24
-2e99

---

(module
  (number)
  (number)
  (number)
  (number)
  (number)
  (negate (number))
  (negate (number))
)

===========================================================================================
numbers_prefixed
===========================================================================================

0b10101
0o070605
0xfeedface
-0b1111
-0o172
-0x7f

---

(module
  (number)
  (number)
  (number)
  (negate (number))
  (negate (number))
  (negate (number))
)

===========================================================================================
strings_single_line
===========================================================================================

'hello'
"goodbye"

---

(module
  (string)
  (string)
)

===========================================================================================
strings_multi_line
===========================================================================================

'multi
line
string'
"another
long
string"

---

(module
  (string)
  (string)
)

===========================================================================================
strings_interpolated
===========================================================================================

'foo is $foo'
'foo, bar is ${foo, bar}'

---

(module
  (string
    (identifier)
  )
  (string
    (identifier)
    (identifier)
  )
)
