===========================================================================================
string_single_line
===========================================================================================

''
'hello'
"goodbye"
'#'
'"'
"'"

---

(module
  (string)
  (string (string_content))
  (string (string_content))
  (string (string_content))
  (string (string_content))
  (string (string_content))
)

===========================================================================================
string_multi_line
===========================================================================================

'multi
line
string'
"another
long
string"

---

(module
  (string (string_content))
  (string (string_content))
)

===========================================================================================
string_interpolated
===========================================================================================

'foo is {foo}'
'foo, bar is {foo, bar}'
'inline comment in expression {foo, #- bar -# bar}'

---

(module
  (string
    (string_content
      (interpolation (identifier))
    )
  )
  (string
    (string_content
      (interpolation
        (comma_separated
          (identifier)
          (identifier)
        )
      )
    )
  )
  (string
    (string_content
      (interpolation
        (comma_separated
          (identifier)
          (comment)
          (identifier)
        )
      )
    )
  )
)

===========================================================================================
format_string_in_interpolated_expression
===========================================================================================

'{foo:.2}'
'{foo:>9.1}'
'{foo:_^8.2}'

---

(module
  (string
    (string_content
      (interpolation
        (identifier)
        (format
          (number)
        )
      )
    )
  )
  (string
    (string_content
      (interpolation
        (identifier)
        (format
          (alignment)
          (number)
        )
      )
    )
  )
  (string
    (string_content
      (interpolation
        (identifier)
        (format
          (fill_char)
          (alignment)
          (number)
        )
      )
    )
  )
)


===========================================================================================
escapes
===========================================================================================

'foo\n\t\r\\\{bar'
'\'\'\''
"\"''\""
'\x4e foo \xF9'
'foo \u{100abc} \u{f} bar'
'foo \
 bar
'

---

(module
  (string
    (string_content
      (escape)
      (escape)
      (escape)
      (escape)
      (escape)
    )
  )
  (string
    (string_content
      (escape)
      (escape)
      (escape)
    )
  )
  (string
    (string_content
      (escape)
      (escape)
    )
  )
  (string
    (string_content
      (escape)
      (escape)
    )
  )
  (string
    (string_content
      (escape)
      (escape)
    )
  )
  (string
    (string_content
      (escape)
    )
  )
)

===========================================================================================
raw_strings
===========================================================================================

r'{foo}\r\n'
r"'\#"
r#""bar""#
r##"#"hi"#"##

---

(module
  (string (raw_string_content))
  (string (raw_string_content))
  (string (raw_string_content))
  (string (raw_string_content))
)

===========================================================================================
incomplete_string_interpolation
===========================================================================================

'{} x'
'y {'

---

(module
  (string (string_content (interpolation)))
  (ERROR (ERROR))
)
