===========================================================================================
import_with_three_items
===========================================================================================

from foo import a, b, c

---

(module
  (import
    (import_module (identifier))
    (import_items
      (identifier)
      (identifier)
      (identifier)
    )
  )
)

===========================================================================================
binary_op_multi_line_pre
===========================================================================================

1
  + 2
    * 3
  + 4

---

(module
  (binary_op
    (binary_op
      (binary_op
        (number)
        (number)
      )
      (number)
    )
    (number)
  )
)

===========================================================================================
assignment_comma_separated
===========================================================================================

a = 1, 2, 3, 4
---

(module
  (assign
    (identifier)
    (expressions (number) (number) (number) (number))
  )
)

===========================================================================================
assignment_multi_line
===========================================================================================

foo = 1,
      2,

---

(module
  (assign
    (identifier)
    (expressions
      (number)
      (number)
    )
  )
)
